Revit 2026 API

# ChangeType Methods

---

The ChangeType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConcatenateChangeTypes | Creates a ChangeType that is a union of the two input ChangeTypes |
|  | Contains | Checks whether this ChangeType contains the input ChangeType |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsIdentical | Compares if two ChangeTypes are identical |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ChangeType Class

Autodesk.Revit.DB Namespace